In [15]:
# import dependencies
import pandas as pd
import matplotlib.pyplot as plt
from sqlalchemy import create_engine

#import postgress username and password
from config import username
from config import password

engine = create_engine(f"postgresql://{username}:{password}@localhost:5432/EmployeeSQL")
conn = engine.connect()

print(engine)

Engine(postgresql://postgres:***@localhost:5432/EmployeeSQL)

In [17]:
# test connection to pull table for visual
data = pd.read_sql("SELECT * FROM titles", conn)
data.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer